matching.org
#+TITLE:    School Choice Algorithms
#+AUTHOR:    Christoph Schottmüller
#+EMAIL:    
#+DATE:      
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_HEAD: <script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script>

* Reading in preferences and priorities

A school choice problem consists of the following ingredients: A number of schools and a number of students, for each student a preference ordering over schools, for each school a capacity and a priority ordering over students. If we have $n$ students, we will call these students 0,1,...,n-1. Similarly, we call the $m$ schools 0, 1,...,m-1. We assume that there are two text files which contain all the data:

- the first file has in each line the capacity and priority ordering of one school. A priority ordering is a comma separated list of integers where the first integer is the student number of the student with the highest priority. The first line contains as first entry the capacity and then the priority ordering of school 0, the second of school 1 etc.
- the second file has in each line the preference ordering of one student. A preference ordering is a comma separated list of integers where the first integer is the school number of the most preferred school etc. The first line contains the preferences of student 0 etc.

The function $read\_sc$ takes the file names of these two files and transforms the data in a usable format. What we want to have is 
- a list /capacity/ that contains as /k/-th element the capacity of school /k/,
- a list /priority/ that consists of /m/ lists where the /k/-th list contains the priority ordering of school /k/ (as usual in python we start counting at 0),
- a list /preference/ that contains /n/ lists where the /k/-th list contains the preference of student /k/.

The following code reads the file containing information on the schools line by line. It deletes the linebreak character '\n', splits the line into a list using ',' as separator, extracts the information necessary, changes the type of the information from string to integer and appends the first number to the capacity list and the rest to the priority list. The same is then done for the student file and the preference list. Finally, all three lists are returned.
#+BEGIN_SRC python :exports code
  def read_sc(school,student):
      """reads in data from two files: 'school' contains in line k first the capacity of school k and then the student numbers separated by ',' ordered according to k's priorities from highest to lowest priority; 'student' has in line k the preferences of student k i.e. a sequence of school numbers from best to worst separated by ',' """
      school_file = open(school,'r')
      capacity = []
      priority = []
      for line in school_file:
          line.strip()
          line = line.split(',')
          num_line = []
          for element in line:
              num_line.append(int(element))
          capacity.append(num_line.pop(0))
          priority.append(num_line)
      school_file.close()
      stud_file = open(student,'r')
      preference = []
      for line in stud_file:
          line.strip()
          line = line.split(',')
          num_line=[]
          for element in line:
              num_line.append(int(element))
          preference.append(num_line)
      stud_file.close()
      return priority, capacity, preference
#+END_SRC

