matching.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>School Choice Algorithms</title>
<!-- 2015-11-10 Tue 14:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Schottmüller" />
</head>
<body>
<div id="content">
<h1 class="title">School Choice Algorithms</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Reading in preferences and priorities</h2>
<div class="outline-text-2" id="text-1">
<p>
A school choice problem consists of the following ingredients: A number of schools and a number of students, for each student a preference ordering over schools, for each school a capacity and a priority ordering over students. If we have \(n\) students, we will call these students 0,1,&#x2026;,n-1. Similarly, we call the \(m\) schools 0, 1,&#x2026;,m-1. We assume that there are two text files which contain all the data:
</p>

<ul class="org-ul">
<li>the first file has in each line the capacity and priority ordering of one school. A priority ordering is a comma separated list of integers where the first integer is the student number of the student with the highest priority. The first line contains as first entry the capacity and then the priority ordering of school 0, the second of school 1 etc.
</li>
<li>the second file has in each line the preference ordering of one student. A preference ordering is a comma separated list of integers where the first integer is the school number of the most preferred school etc. The first line contains the preferences of student 0 etc.
</li>
</ul>

<p>
The function \(read\_sc\) takes the file names of these two files and transforms the data in a usable format. What we want to have is 
</p>
<ul class="org-ul">
<li>a list <i>capacity</i> that contains as <i>k</i>-th element the capacity of school <i>k</i>,
</li>
<li>a list <i>priority</i> that consists of <i>m</i> lists where the <i>k</i>-th list contains the priority ordering of school <i>k</i> (as usual in python we start counting at 0),
</li>
<li>a list <i>preference</i> that contains <i>n</i> lists where the <i>k</i>-th list contains the preference of student <i>k</i>.
</li>
</ul>

<p>
The following code reads the file containing information on the schools line by line. It deletes the linebreak character '\n', splits the line into a list using ',' as separator, extracts the information necessary, changes the type of the information from string to integer and appends the first number to the capacity list and the rest to the priority list. The same is then done for the student file and the preference list. Finally, all three lists are returned.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">read_sc</span>(school,student):
    <span style="color: #2aa198;">"""reads in data from two files: 'school' contains in line k first the capacity of school k and then the student numbers separated by ',' ordered according to k's priorities from highest to lowest priority; 'student' has in line k the preferences of student k i.e. a sequence of school numbers from best to worst separated by ',' """</span>
    <span style="color: #268bd2;">school_file</span> = <span style="color: #859900;">open</span>(school,<span style="color: #2aa198;">'r'</span>)
    <span style="color: #268bd2;">capacity</span> = []
    <span style="color: #268bd2;">priority</span> = []
    <span style="color: #859900;">for</span> line <span style="color: #859900;">in</span> school_file:
        line.strip()
        <span style="color: #268bd2;">line</span> = line.split(<span style="color: #2aa198;">','</span>)
        <span style="color: #268bd2;">num_line</span> = []
        <span style="color: #859900;">for</span> element <span style="color: #859900;">in</span> line:
            num_line.append(<span style="color: #859900;">int</span>(element))
        capacity.append(num_line.pop(0))
        priority.append(num_line)
    school_file.close()
    <span style="color: #268bd2;">stud_file</span> = <span style="color: #859900;">open</span>(student,<span style="color: #2aa198;">'r'</span>)
    <span style="color: #268bd2;">preference</span> = []
    <span style="color: #859900;">for</span> line <span style="color: #859900;">in</span> stud_file:
        line.strip()
        <span style="color: #268bd2;">line</span> = line.split(<span style="color: #2aa198;">','</span>)
        <span style="color: #268bd2;">num_line</span>=[]
        <span style="color: #859900;">for</span> element <span style="color: #859900;">in</span> line:
            num_line.append(<span style="color: #859900;">int</span>(element))
        preference.append(num_line)
    stud_file.close()
    <span style="color: #859900;">return</span> priority, capacity, preference
</pre>
</div>
</div>
</div>
