matching.org
* Generating a school choice problem (randomly)

In order to test the code later on (in case we do not have real data to use), we want to have the possibility to generate example school choice problems. The function below randomly generates such problems. It takes as arguments the number of schools and students. Optional arguments can be used to indicate that only problems where 
- there is more capacity than students
- the overcapacity is limited by the given argument
are generated. The last optional argument indicates whether the problem should be saved in files (in the format that can be read by $read\_sc$; see above). As the function is a bit longer, we split it up in several parts. 

First, the capacity list is created. For each school, a capacity is randomly drawn from a triangular distribution with mode at 0.2*nstud/nschool (and support from nstud/(10*nschool) to 3*nstud/nschool). If the overcapacity option is given, it is checked that indeed there is overcapacity; otherwise the procedure is repeated. Similarly, with the maxovercapacity option.

#+BEGIN_SRC python :exports code
  def gen_sc(nschool,nstud,overcap=False,maxovercap=False,savefile=False):
      """generates a (pseudo) random school choice problem with nstud students and nschool schools; if overcap ==True, the problem will have a higher number school places than students; maxovercap is a maximum overcapacity allowed; savefile=True will OVERWRITE/save the generated example in the files school.txt and student.txt in the current working directory"""
      capacity = []
      average = float(nstud)/nschool
      i = 1
      while i<= nschool:
          capacity.append(int(random.triangular(average/10.0,3*average,0.2*average)))#draws capacity from a triangular distribution between average/5 and 5*average with mode at 0.9*average
          i = i + 1
          #print capacity, i, nschool, sum(capacity)
          if i == nschool and overcap==True and sum(capacity)<nstud:#checks that enough places for all students are available
              capacity = []
              i = 1
          if maxovercap!=False and sum(capacity)>nstud + maxovercap:
              capacity = []
              i = 1
#+END_SRC
The next part creates priority and preferences randomly. First a list [1,2,...,nstud] is created and then the order of this list is randomly shuffled.

#+BEGIN_SRC python :exports code
      priority = []
      for i in range(nschool):
          x = range(nstud)
          random.shuffle(x)
          priority.append(x)
      preference = []
      for j in range(nstud):
          x = range(nschool)
          random.shuffle(x)
          preference.append(x)
#+END_SRC
If the overcapacity option is False, then it can be the case that there are more students than capacity and some students remain unmatched. To accommodate this option, a dummy school is created: This school has ample capacity and is least liked by all students. All the students that cannot be matched with any proper school will be assigned to this dummy school by the matching algorithms used below. This  trick avoids some technical problems that would otherwise occur (e.g. having unmatched students after every step of the algorithm). Note that the number of schools including the dummy school is nschool+1. 

#+BEGIN_SRC python :exports code
      if sum(capacity)<nstud:#creates a dummy school "nschool+1" to which every student not getting a place will be matched
          for student in preference:
              student.append(nschool)
          priority.append(range(nstud))
          capacity.append(nstud)
#+END_SRC
Finally, we save the generated data in files 'school.txt' and 'student.txt' if the relevant option is not False. These files are generated line by line where first the data is changed into string format, striped of the brackets indicating the begin and end of a list and equipped with a line break. Finally, the generated data is returned.
#+BEGIN_SRC python :exports code
      if savefile!=False:
          school_file = open('school.txt','w')
          for i in range(nschool):
              line = str(capacity[i]) + ','
              priority_str = str(priority[i])
              priority_str = priority_str.strip('[')
              priority_str = priority_str.strip(']')
              line = line + priority_str 
              school_file.write(line)
              school_file.write("\n")
          school_file.close()
          stud_file = open('student.txt','w')
          for i in range(nstud):
              line = str(preference[i])
              line = line.strip('[')
              line = line.strip(']')
              stud_file.write(line)
              stud_file.write("\n")
          stud_file.close()
      return priority, capacity, preference

#+END_SRC

