matching.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Generating a school choice problem (randomly)</h2>
<div class="outline-text-2" id="text-2">
<p>
In order to test the code later on (in case we do not have real data to use), we want to have the possibility to generate example school choice problems. The function below randomly generates such problems. It takes as arguments the number of schools and students. Optional arguments can be used to indicate that only problems where 
</p>
<ul class="org-ul">
<li>there is more capacity than students
</li>
<li>the overcapacity is limited by the given argument
</li>
</ul>
<p>
are generated. The last optional argument indicates whether the problem should be saved in files (in the format that can be read by \(read\_sc\); see above). As the function is a bit longer, we split it up in several parts. 
</p>

<p>
First, the capacity list is created. For each school, a capacity is randomly drawn from a triangular distribution with mode at 0.2*nstud/nschool (and support from nstud/(10*nschool) to 3*nstud/nschool). If the overcapacity option is given, it is checked that indeed there is overcapacity; otherwise the procedure is repeated. Similarly, with the maxovercapacity option.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">gen_sc</span>(nschool,nstud,overcap=<span style="color: #2aa198;">False</span>,maxovercap=<span style="color: #2aa198;">False</span>,savefile=<span style="color: #2aa198;">False</span>):
    <span style="color: #2aa198;">"""generates a (pseudo) random school choice problem with nstud students and nschool schools; if overcap ==True, the problem will have a higher number school places than students; maxovercap is a maximum overcapacity allowed; savefile=True will OVERWRITE/save the generated example in the files school.txt and student.txt in the current working directory"""</span>
    <span style="color: #268bd2;">capacity</span> = []
    <span style="color: #268bd2;">average</span> = <span style="color: #859900;">float</span>(nstud)/nschool
    <span style="color: #268bd2;">i</span> = 1
    <span style="color: #859900;">while</span> i&lt;= nschool:
        capacity.append(<span style="color: #859900;">int</span>(random.triangular(average/10.0,3*average,0.2*average)))<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">draws capacity from a triangular distribution between average/5 and 5*average with mode at 0.9*average</span>
        <span style="color: #268bd2;">i</span> = i + 1
        <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">print capacity, i, nschool, sum(capacity)</span>
        <span style="color: #859900;">if</span> i == nschool <span style="color: #859900;">and</span> overcap==<span style="color: #2aa198;">True</span> <span style="color: #859900;">and</span> <span style="color: #859900;">sum</span>(capacity)&lt;nstud:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">checks that enough places for all students are available</span>
            <span style="color: #268bd2;">capacity</span> = []
            <span style="color: #268bd2;">i</span> = 1
        <span style="color: #859900;">if</span> maxovercap!=<span style="color: #2aa198;">False</span> <span style="color: #859900;">and</span> <span style="color: #859900;">sum</span>(capacity)&gt;nstud + maxovercap:
            <span style="color: #268bd2;">capacity</span> = []
            <span style="color: #268bd2;">i</span> = 1
</pre>
</div>
<p>
The next part creates priority and preferences randomly. First a list [1,2,&#x2026;,nstud] is created and then the order of this list is randomly shuffled.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">priority</span> = []
<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nschool):
    <span style="color: #268bd2;">x</span> = <span style="color: #859900;">range</span>(nstud)
    random.shuffle(x)
    priority.append(x)
<span style="color: #268bd2;">preference</span> = []
<span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nstud):
    <span style="color: #268bd2;">x</span> = <span style="color: #859900;">range</span>(nschool)
    random.shuffle(x)
    preference.append(x)
</pre>
</div>
<p>
If the overcapacity option is False, then it can be the case that there are more students than capacity and some students remain unmatched. To accommodate this option, a dummy school is created: This school has ample capacity and is least liked by all students. All the students that cannot be matched with any proper school will be assigned to this dummy school by the matching algorithms used below. This  trick avoids some technical problems that would otherwise occur (e.g. having unmatched students after every step of the algorithm). Note that the number of schools including the dummy school is nschool+1. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">if</span> <span style="color: #859900;">sum</span>(capacity)&lt;nstud:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">creates a dummy school "nschool+1" to which every student not getting a place will be matched</span>
    <span style="color: #859900;">for</span> student <span style="color: #859900;">in</span> preference:
        student.append(nschool)
    priority.append(<span style="color: #859900;">range</span>(nstud))
    capacity.append(nstud)
</pre>
</div>
<p>
Finally, we save the generated data in files 'school.txt' and 'student.txt' if the relevant option is not False. These files are generated line by line where first the data is changed into string format, striped of the brackets indicating the begin and end of a list and equipped with a line break. Finally, the generated data is returned.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">if</span> savefile!=<span style="color: #2aa198;">False</span>:
    <span style="color: #268bd2;">school_file</span> = <span style="color: #859900;">open</span>(<span style="color: #2aa198;">'school.txt'</span>,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nschool):
        <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(capacity[i]) + <span style="color: #2aa198;">','</span>
        <span style="color: #268bd2;">priority_str</span> = <span style="color: #859900;">str</span>(priority[i])
        <span style="color: #268bd2;">priority_str</span> = priority_str.strip(<span style="color: #2aa198;">'['</span>)
        <span style="color: #268bd2;">priority_str</span> = priority_str.strip(<span style="color: #2aa198;">']'</span>)
        <span style="color: #268bd2;">line</span> = line + priority_str 
        school_file.write(line)
        school_file.write(<span style="color: #2aa198;">"\n"</span>)
    school_file.close()
    <span style="color: #268bd2;">stud_file</span> = <span style="color: #859900;">open</span>(<span style="color: #2aa198;">'student.txt'</span>,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nstud):
        <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(preference[i])
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">'['</span>)
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">']'</span>)
        stud_file.write(line)
        stud_file.write(<span style="color: #2aa198;">"\n"</span>)
    stud_file.close()
<span style="color: #859900;">return</span> priority, capacity, preference
</pre>
</div>
</div>
</div>
