matching.org
* The schoolchoice class
We now generate a class 'schoolchoice'. An instance of this class is a specific school choice problem, i.e. we have given capacity, priority and preference lists. The class will contain functions that we can use on this specific problems, e.g. matching algorithms. As the code is a bit longer, we split it up in different parts.

When we create an instance of the class we have to give the priority, capacity and preference list as arguments. These become variables of this instance. The number of students and schools is readily derived from these lists and saved. We also create variables that are empty for now but will save the calculated matchings as soon as we have calculated them.

#+BEGIN_SRC python :exports code
  class schoolchoice:
      def __init__(self,priority, capacity, preference):
          """read in data: priorities is a list of lists where the kth lower level list is the priority of school k, capacity is a list of school capacities (same order of schools as in priority), preferences is a list of lists where the ith sublist is the preference ranking of student i"""
          self.priority = priority
          self.capacity = capacity
          self.preference = preference
          self.nschool = len(capacity)
          if self.nschool != len(priority):
              print "input error: capacity and priority list must have same length"
          self.nstud = len(preference)
          self.gs_match = []#will contain Gale Shapley match if this is calculated
          self.boston_match = []

#+END_SRC

** Gale Shapley algorithm
The Gale Shapley[fn:gs] algorithm creates a matching that has the following advantages
- strategy proofness for students: no student can improve his outcome by submitting a wrong preference profile.
- stability: There is no student-school pair such that the student prefers this school over his assigned school and at the same time he has higher priority at this school than some student assigned to it.
- student optimality among stable matchings: there is no other stable matching in which some student(s) would be assigned a more preferred school than the one he is assigned in the Gale-Shapley algorithm.
- finiteness: the algorithm converges in a finite number of steps.

The algorithm can be illustrated nicely with the following thought experiment: There are a number of rounds. In each round, every unmatched student applies at his most preferred school among the schools he did not apply in earlier rounds. Schools accept in each round the most preferred students among those students that apply and those students that were matched with the school in the previous round. Of course, each school can in each round not be matched with more students than its capacity. The algorithm stops when all students are matched at the end of a round.

Each round is given by one iteration of the "while flag==0" loop. In each round, we loop over all schools ('for i in range(self.school):'):
1. first we determine the list of students that have this school as their highest priority and order them according to the school's priority ('proposers').
2. we match either all proposers (less proposers than capacity) or as many as possible with the school. In the latter case, the unmatched students are put in the list 'unmatched'.
At the end of the round, we check whether there are unmatched students. If not, the algorithm stops. If there are unmatched students, we delete the first preference in their preference ordering (this is the schooled to which they applied in this round and could not get in). This little trick is notationally convenient as it allows us to say that everyone applies to his most preferred school in the remaining preference ordering in each round (see step 1 above).

#+BEGIN_SRC python :exports code
      def gs(self):
          """uses the Gale Shapley student proposing algorithm to solve the matching problem"""
          flag = 0 #dummy used to indicate whether the algorithm has finished
          pref = list(self.preference) #useful as the algorithm manipulates this list
          while flag == 0:
              flag = 1
              match = []#contains list of lists where the kth lower level list are the students matched with school k
              unmatched = []#list of unmatched students
              for i in range(self.nschool):
                  proposers = filter(lambda x: i==pref[x][0],self.priority[i])# list of students proposing to i in this round
                  if len(proposers)<=self.capacity[i]:
                      match.append(proposers)
                  else:
                      match.append(proposers[:self.capacity[i]])
                      unmatched = unmatched +proposers[self.capacity[i]:]
              if unmatched != []:
                  flag = 0
                  for j in unmatched:
                      pref[j]=pref[j][1:] #deletes the top preference for the unmatched
          self.gs_match = list(match)
          return match
#+END_SRC

