matching.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The schoolchoice class</h2>
<div class="outline-text-2" id="text-3">
<p>
We now generate a class 'schoolchoice'. An instance of this class is a specific school choice problem, i.e. we have given capacity, priority and preference lists. The class will contain functions that we can use on this specific problems, e.g. matching algorithms. As the code is a bit longer, we split it up in different parts.
</p>

<p>
When we create an instance of the class we have to give the priority, capacity and preference list as arguments. These become variables of this instance. The number of students and schools is readily derived from these lists and saved. We also create variables that are empty for now but will save the calculated matchings as soon as we have calculated them.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #b58900;">schoolchoice</span>:
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900;">self</span>,priority, capacity, preference):
        <span style="color: #2aa198;">"""read in data: priorities is a list of lists where the kth lower level list is the priority of school k, capacity is a list of school capacities (same order of schools as in priority), preferences is a list of lists where the ith sublist is the preference ranking of student i"""</span>
        <span style="color: #859900;">self</span>.priority = priority
        <span style="color: #859900;">self</span>.capacity = capacity
        <span style="color: #859900;">self</span>.preference = preference
        <span style="color: #859900;">self</span>.nschool = <span style="color: #859900;">len</span>(capacity)
        <span style="color: #859900;">if</span> <span style="color: #859900;">self</span>.nschool != <span style="color: #859900;">len</span>(priority):
            <span style="color: #859900;">print</span> <span style="color: #2aa198;">"input error: capacity and priority list must have same length"</span>
        <span style="color: #859900;">self</span>.nstud = <span style="color: #859900;">len</span>(preference)
        <span style="color: #859900;">self</span>.gs_match = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will contain Gale Shapley match if this is calculated</span>
        <span style="color: #859900;">self</span>.boston_match = []
</pre>
</div>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Gale Shapley algorithm</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The Gale Shapley<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> algorithm creates a matching that has the following advantages
</p>
<ul class="org-ul">
<li>strategy proofness for students: no student can improve his outcome by submitting a wrong preference profile.
</li>
<li>stability: There is no student-school pair such that the student prefers this school over his assigned school and at the same time he has higher priority at this school than some student assigned to it.
</li>
<li>student optimality among stable matchings: there is no other stable matching in which some student(s) would be assigned a more preferred school than the one he is assigned in the Gale-Shapley algorithm.
</li>
<li>finiteness: the algorithm converges in a finite number of steps.
</li>
</ul>

<p>
The algorithm can be illustrated nicely with the following thought experiment: There are a number of rounds. In each round, every unmatched student applies at his most preferred school among the schools he did not apply in earlier rounds. Schools accept in each round the most preferred students among those students that apply and those students that were matched with the school in the previous round. Of course, each school can in each round not be matched with more students than its capacity. The algorithm stops when all students are matched at the end of a round.
</p>

<p>
Each round is given by one iteration of the "while flag==0" loop. In each round, we loop over all schools ('for i in range(self.school):'):
</p>
<ol class="org-ol">
<li>first we determine the list of students that have this school as their highest priority and order them according to the school's priority ('proposers').
</li>
<li>we match either all proposers (less proposers than capacity) or as many as possible with the school. In the latter case, the unmatched students are put in the list 'unmatched'.
</li>
</ol>
<p>
At the end of the round, we check whether there are unmatched students. If not, the algorithm stops. If there are unmatched students, we delete the first preference in their preference ordering (this is the schooled to which they applied in this round and could not get in). This little trick is notationally convenient as it allows us to say that everyone applies to his most preferred school in the remaining preference ordering in each round (see step 1 above).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">gs</span>(<span style="color: #859900;">self</span>):
    <span style="color: #2aa198;">"""uses the Gale Shapley student proposing algorithm to solve the matching problem"""</span>
    <span style="color: #268bd2;">flag</span> = 0 <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy used to indicate whether the algorithm has finished</span>
    <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
    <span style="color: #859900;">while</span> flag == 0:
        <span style="color: #268bd2;">flag</span> = 1
        <span style="color: #268bd2;">match</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">contains list of lists where the kth lower level list are the students matched with school k</span>
        <span style="color: #268bd2;">unmatched</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of unmatched students</span>
        <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):
            <span style="color: #268bd2;">proposers</span> = <span style="color: #859900;">filter</span>(<span style="color: #859900;">lambda</span> x: i==pref[x][0],<span style="color: #859900;">self</span>.priority[i])<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">list of students proposing to i in this round</span>
            <span style="color: #859900;">if</span> <span style="color: #859900;">len</span>(proposers)&lt;=<span style="color: #859900;">self</span>.capacity[i]:
                match.append(proposers)
            <span style="color: #859900;">else</span>:
                match.append(proposers[:<span style="color: #859900;">self</span>.capacity[i]])
                <span style="color: #268bd2;">unmatched</span> = unmatched +proposers[<span style="color: #859900;">self</span>.capacity[i]:]
        <span style="color: #859900;">if</span> unmatched != []:
            <span style="color: #268bd2;">flag</span> = 0
            <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> unmatched:
                <span style="color: #268bd2;">pref</span>[j]=pref[j][1:] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes the top preference for the unmatched</span>
    <span style="color: #859900;">self</span>.gs_match = <span style="color: #859900;">list</span>(match)
    <span style="color: #859900;">return</span> match
</pre>
</div>
</div>
</div>
