matching.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Top trading cycles algorithm</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In this algorithm, every student "points" at his most preferred school and every school "points" at its highest ranked student. Then we try to form cycles like \((stud_0,school_a,stud_1,school_b,...,school_z)\) such that each \(school_i\) is the most preferred school of the student listed just before it and every student \(stud_j\) (for \(j>0\)) has highest priority at the school listed directly before him and student \(stud_0\) has highest priority at \(school_z\). If we have such a cycle, all students in the cycle are assigned their most preferred school. Then we repeat this cycle building with all remaining students and schools (that is you can also only point to schools/students that are remaining). "Remaining" are schools that still have empty capacity and students that are not matched yet. This is repeated untill all students are matched. 
</p>

<p>
Initially all students are unmatched and saved in the list <i>unmatched</i>. We use a counter to count down how many seats are left in each school and initialize the counter at full capacity. As long as students are unmatched (<i>while unmatched!=[]</i>), we try to construct cycles. We simply start with the first unmatched student and determine his most preferred school. We have two lists:
</p>
<ul class="org-ul">
<li><i>cyc<sub>stud</sub></i> contains the students in our potential cycle
</li>
<li><i>cyc<sub>school</sub></i> contains the schools in our potential cycle.
</li>
</ul>

<p>
Next we determine the student with highest priority at the - so far - last school in <i>cyc<sub>school</sub></i>. 
</p>
<ul class="org-ul">
<li>If this student is already in othe <i>cyc<sub>stud</sub></i>, then we have found a cycle: It starts at this student and contains all students following after him in <i>cyc<sub>stud</sub></i>. Now we have to do a couple of things: Match those students to their most preferred schools, removing the matched students from <i>unmatched</i>, decrease the counter of schools that got a student by 1, remove the matched students from the priorities of all schools (so that these schools can no longer point at already matched students in later rounds) and finally remove schools that are full (i.e. whose counter is zero) from students preferences in order to prevent students to point at those schools in later rounds.
</li>
<li>If the student is not in <i>cyc<sub>stud</sub></i>, we add him. Then we do the same as above for the school preferred most by the newly added student. Again, either a cycle is formed (if the school is already in <i>scy<sub>school</sub></i>) and then we have to do all the things mentioned above or the school has to be added to <i>cyc<sub>school</sub></i>.
</li>
</ul>

<p>
The appending goes on until we have a cycle. There will always be a cycle eventually because the problem has a finite number of schools and students. As soon as a cycle is constructed (and all the necessary removals etc. have been done), we start again with the cycle building and continue until all students are matched. Note that it is immaterial that we always start with the first unmatched student: In each round a student can only be in one cycle. If several cycles exist and we match people in one cycle, then the other cycles will remain intact and will be simply picked up in later rounds (the students in those cycles will still get their most preferred school&#x2026;just a few rounds later).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">ttc</span>(<span style="color: #859900;">self</span>):
    <span style="color: #2aa198;">"""Uses the top trading cycle algorithm on the matching problem"""</span>
    <span style="color: #268bd2;">unmatched</span> = <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">unmatched students</span>
    <span style="color: #268bd2;">match</span> = [[] <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool)]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">contains list of lists where the kth lower level list are the students matched with school k</span>
    <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference)
    <span style="color: #268bd2;">priori</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.priority)
    <span style="color: #268bd2;">counter</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.capacity)
    <span style="color: #859900;">while</span> unmatched != []:
        <span style="color: #268bd2;">cyc_stud</span> = [unmatched[0]]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">first unmatched student</span>
        <span style="color: #268bd2;">cyc_school</span> = [pref[unmatched[0]][0]]
        <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">False</span><span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">indicates whether we have a cycle</span>
        <span style="color: #859900;">while</span> cyc_closed == <span style="color: #2aa198;">False</span>:
            <span style="color: #268bd2;">top_stud</span> = priori[cyc_school[<span style="color: #859900;">len</span>(cyc_school)-1]][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student with highest priority in last school in cyc_school</span>
            <span style="color: #859900;">if</span> top_stud <span style="color: #859900;">in</span> cyc_stud:
                <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">True</span>
                <span style="color: #268bd2;">cyc_stud</span> = cyc_stud[cyc_stud.index(top_stud):] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes the students that are not par tof the cycle</span>
                <span style="color: #859900;">for</span> stud <span style="color: #859900;">in</span> cyc_stud:
                    <span style="color: #268bd2;">school0</span> = pref[stud][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the school to which stud is matched</span>
                    unmatched.remove(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the student from unmatched</span>
                    match[school0].append(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">adds the student to match</span>
                    <span style="color: #268bd2;">counter</span>[school0] = counter[school0] - 1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">decreases capacity counter</span>
                    <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the matched student from all schools priorities</span>
                        <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">using "try" avoids error if stud is not elligible at a certain school, i.e. not in its priority ranking</span>
                            priori[k].remove(stud)
                        <span style="color: #859900;">except</span>:
                            <span style="color: #859900;">pass</span>
                    <span style="color: #859900;">if</span> counter[school0] == 0:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes schools that have no capacity left from remaining students preferences</span>
                        <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud):
                            <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the remove command below returns an error if a student did not list school0 in his preferences</span>
                                pref[j].remove(school0)
                            <span style="color: #859900;">except</span>:
                                <span style="color: #859900;">pass</span>
            <span style="color: #859900;">else</span>:
                cyc_stud.append(top_stud)
            <span style="color: #268bd2;">top_school</span> = pref[cyc_stud[<span style="color: #859900;">len</span>(cyc_stud)-1]][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">most preferred school of last student in cyc_stud</span>
            <span style="color: #859900;">if</span> top_school <span style="color: #859900;">in</span> cyc_school <span style="color: #859900;">and</span> cyc_closed == <span style="color: #2aa198;">False</span>:
                <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">True</span>
                <span style="color: #268bd2;">cyc_school</span> = cyc_school[cyc_school.index(top_school):]
                <span style="color: #859900;">for</span> school <span style="color: #859900;">in</span> cyc_school:
                    <span style="color: #268bd2;">stud</span> = priori[school][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student to which school points</span>
                    unmatched.remove(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student is removed from unmatched</span>
                    match[school].append(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">adds the student to match</span>
                    <span style="color: #268bd2;">counter</span>[school] = counter[school] - 1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">reduce counter by 1</span>
                    <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the matched student from all schools priorities</span>
                        <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">using "try" avoids error if stud is not elligible at a certain school, i.e. not in its priority ranking</span>
                            priori[k].remove(stud)
                        <span style="color: #859900;">except</span>:
                            <span style="color: #859900;">pass</span>
                    <span style="color: #859900;">if</span> counter[school] == 0:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes schools that have no capacity left from remaining students preferences</span>
                        <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud):
                            <span style="color: #859900;">try</span>:
                                pref[j].remove(school)
                            <span style="color: #859900;">except</span>:
                                <span style="color: #859900;">pass</span>
            <span style="color: #859900;">elif</span> cyc_closed == <span style="color: #2aa198;">False</span>:
                cyc_school.append(top_school)
    <span style="color: #859900;">self</span>.ttc_match = <span style="color: #859900;">list</span>(match)
    <span style="color: #859900;">return</span> match
</pre>
</div>
</div>
</div>
