matching.org
** Boston student matching algorithm

This algorithm was used in Boston (and other cities) for some time. It has the advantage that the matching is Pareto efficient if all students submit their true preferences. Unfortunately, it is not strategy proof which means that for some preference profiles some students could benefit from submitting a wrong preference ('game the system').

The algorithm works in rounds. In round 1, we try to put all students to the school that is their most preferred school. If the number of students having school /k/ as most preferred is higher than the capacity of school /k/, we use the priority ordering of /k/ to determine who gets the place. In round 2, we try to allocate all the students that did not get a place in the first round to their second most preferred school. If the remaining capacity of a school ('remaining' because some students got a place there in the first round), we use the priority order to determine who gets the place. We continue like this until all students have a place.

Each round is given by one iteration of the 'while flag==0' loop. As in the Gale Shapley algorithm, we the loop over schools ('for i in range(self.nschool)'). The list of 'proposers' (unmatched students who have this school as their top remaining choice) is ordered according to the school's priority ranking and as many as possible are allocated to the remaining capacity (we then reduce the remaining capacity accordingly). The one's that could not be matched are put on the unmatched list, the one's matched to school $i$ are put on the match[i] list. The algorithm stops if no student is unmatched at the end of a round. At the end of a round, the top preference of the unmatched is deleted from their preferences. This allows us to write out code as if everyone only considers his top preference in each round.

#+BEGIN_SRC python :exports code

      def boston(self):
          """uses the Boston school matching algorithm to solve the matching problem"""
          flag = 0 #dummy used to indicate whether the algorithm has finished
          pref = list(self.preference) #useful as the algorithm manipulates this list
          capa = list(self.capacity) #useful as the algorithm manipulates this list
          match = [[] for i in range(self.nschool)] #list of nschool empty lists, kth list is list of students at school k
          while flag == 0:
              flag = 1
              unmatched = []#list of unmatched students
              for i in range(self.nschool):
                  proposers = filter(lambda x: i==pref[x][0] and x not in match[i],self.priority[i])# list of students proposing to i in this round
                  if len(proposers)<=capa[i]:
                      match[i] = match[i] + proposers
                      capa[i] = capa[i] - len(proposers)
                  else:
                      match[i] = match[i] + proposers[:capa[i]]
                      unmatched = unmatched + proposers[capa[i]:]
                      capa[i] = 0
              if unmatched != []:
                  flag = 0
                  for j in unmatched:
                      pref[j].pop(0) #deletes the top preference for the unmatched

#+END_SRC


* Saving calculated matchings
There are two convenient ways to represent a matching: first, a list that gives for each student the school he is assigned. Second, a list that gives for each school the students it is assigned.

The function below creates both files for a given match (file names are optional). Matchings are represented as a list of lists where the /k/-th lower level list contains the students assigned to school /k/. Hence, going through the matching one lower level list at a time only requires a bit of formatting to get the matching in the second representation. To get the firs representation, we create for every student the (student,school) tuple and sort those tuples according to student numbers before doing some basic formatting and saving.

#+BEGIN_SRC python :exports code
  def save_match(match,filename_school='match_school.txt',filename_student='match_student.txt'):
      """saves a given match in 2 files: 'match_school' contains in line k the student numbers matched to school k; 'match_student' contains in line k the school matched to student k"""
      student_lst1 = []
      school_lst = open(filename_school,'w')
      for school in range(len(match)):
          for student in match[school]:
              student_lst1.append((student,school))
          line = str(match[school].sort())
          line = line.strip('[')
          line = line.strip(']')
          school_lst.write(line)
          school_lst.write('\n')
      student_lst1 = sorted(student_lst1)
      student_lst = open(filename_student,'w')
      for item in student_lst1:
          student_lst.write(str(item[1]))
          student_lst.write('\n')
      student_lst.close()
      school_lst.close()
#+END_SRC

