matching.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Boston student matching algorithm</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This algorithm was used in Boston (and other cities) for some time. It has the advantage that the matching is Pareto efficient if all students submit their true preferences. Unfortunately, it is not strategy proof which means that for some preference profiles some students could benefit from submitting a wrong preference ('game the system').
</p>

<p>
The algorithm works in rounds. In round 1, we try to put all students to the school that is their most preferred school. If the number of students having school <i>k</i> as most preferred is higher than the capacity of school <i>k</i>, we use the priority ordering of <i>k</i> to determine who gets the place. In round 2, we try to allocate all the students that did not get a place in the first round to their second most preferred school. If the remaining capacity of a school ('remaining' because some students got a place there in the first round), we use the priority order to determine who gets the place. We continue like this until all students have a place.
</p>

<p>
Each round is given by one iteration of the 'while flag==0' loop. As in the Gale Shapley algorithm, we the loop over schools ('for i in range(self.nschool)'). The list of 'proposers' (unmatched students who have this school as their top remaining choice) is ordered according to the school's priority ranking and as many as possible are allocated to the remaining capacity (we then reduce the remaining capacity accordingly). The one's that could not be matched are put on the unmatched list, the one's matched to school \(i\) are put on the match[i] list. The algorithm stops if no student is unmatched at the end of a round. At the end of a round, the top preference of the unmatched is deleted from their preferences. This allows us to write out code as if everyone only considers his top preference in each round.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">boston</span>(<span style="color: #859900;">self</span>):
    <span style="color: #2aa198;">"""uses the Boston school matching algorithm to solve the matching problem"""</span>
    <span style="color: #268bd2;">flag</span> = 0 <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy used to indicate whether the algorithm has finished</span>
    <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
    <span style="color: #268bd2;">capa</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.capacity) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
    <span style="color: #268bd2;">match</span> = [[] <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool)] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of nschool empty lists, kth list is list of students at school k</span>
    <span style="color: #859900;">while</span> flag == 0:
        <span style="color: #268bd2;">flag</span> = 1
        <span style="color: #268bd2;">unmatched</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of unmatched students</span>
        <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):
            <span style="color: #268bd2;">proposers</span> = <span style="color: #859900;">filter</span>(<span style="color: #859900;">lambda</span> x: i==pref[x][0] <span style="color: #859900;">and</span> x <span style="color: #859900;">not</span> <span style="color: #859900;">in</span> match[i],<span style="color: #859900;">self</span>.priority[i])<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">list of students proposing to i in this round</span>
            <span style="color: #859900;">if</span> <span style="color: #859900;">len</span>(proposers)&lt;=capa[i]:
                <span style="color: #268bd2;">match</span>[i] = match[i] + proposers
                <span style="color: #268bd2;">capa</span>[i] = capa[i] - <span style="color: #859900;">len</span>(proposers)
            <span style="color: #859900;">else</span>:
                <span style="color: #268bd2;">match</span>[i] = match[i] + proposers[:capa[i]]
                <span style="color: #268bd2;">unmatched</span> = unmatched + proposers[capa[i]:]
                <span style="color: #268bd2;">capa</span>[i] = 0
        <span style="color: #859900;">if</span> unmatched != []:
            <span style="color: #268bd2;">flag</span> = 0
            <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> unmatched:
                pref[j].pop(0) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes the top preference for the unmatched</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Saving calculated matchings</h2>
<div class="outline-text-2" id="text-4">
<p>
There are two convenient ways to represent a matching: first, a list that gives for each student the school he is assigned. Second, a list that gives for each school the students it is assigned.
</p>

<p>
The function below creates both files for a given match (file names are optional). Matchings are represented as a list of lists where the <i>k</i>-th lower level list contains the students assigned to school <i>k</i>. Hence, going through the matching one lower level list at a time only requires a bit of formatting to get the matching in the second representation. To get the firs representation, we create for every student the (student,school) tuple and sort those tuples according to student numbers before doing some basic formatting and saving.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #268bd2;">save_match</span>(match,filename_school=<span style="color: #2aa198;">'match_school.txt'</span>,filename_student=<span style="color: #2aa198;">'match_student.txt'</span>):
    <span style="color: #2aa198;">"""saves a given match in 2 files: 'match_school' contains in line k the student numbers matched to school k; 'match_student' contains in line k the school matched to student k"""</span>
    <span style="color: #268bd2;">student_lst1</span> = []
    <span style="color: #268bd2;">school_lst</span> = <span style="color: #859900;">open</span>(filename_school,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> school <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">len</span>(match)):
        <span style="color: #859900;">for</span> student <span style="color: #859900;">in</span> match[school]:
            student_lst1.append((student,school))
        <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(match[school].sort())
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">'['</span>)
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">']'</span>)
        school_lst.write(line)
        school_lst.write(<span style="color: #2aa198;">'\n'</span>)
    <span style="color: #268bd2;">student_lst1</span> = <span style="color: #859900;">sorted</span>(student_lst1)
    <span style="color: #268bd2;">student_lst</span> = <span style="color: #859900;">open</span>(filename_student,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> item <span style="color: #859900;">in</span> student_lst1:
        student_lst.write(<span style="color: #859900;">str</span>(item[1]))
        student_lst.write(<span style="color: #2aa198;">'\n'</span>)
    student_lst.close()
    school_lst.close()
</pre>
</div>
</div>
</div>
