matching.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> All code together in one program and examples of usage</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-python" id="scp"><span style="color: #859900;">import</span> random
<span style="color: #859900;">import</span> cPickle <span style="color: #859900;">as</span> pickle

<span style="color: #859900;">def</span> <span style="color: #268bd2;">read_sc</span>(school,student):
    <span style="color: #2aa198;">"""reads in data from two files: 'school' contains in line k first the capacity of school k and then the student numbers separated by ',' ordered according to k's priorities from highest to lowest priority; 'student' has in line k the preferences of student k i.e. a sequence of school numbers from best to worst separated by ',' """</span>
    <span style="color: #268bd2;">school_file</span> = <span style="color: #859900;">open</span>(school,<span style="color: #2aa198;">'r'</span>)
    <span style="color: #268bd2;">capacity</span> = []
    <span style="color: #268bd2;">priority</span> = []
    <span style="color: #859900;">for</span> line <span style="color: #859900;">in</span> school_file:
        line.strip()
        <span style="color: #268bd2;">line</span> = line.split(<span style="color: #2aa198;">','</span>)
        <span style="color: #268bd2;">num_line</span> = []
        <span style="color: #859900;">for</span> element <span style="color: #859900;">in</span> line:
            num_line.append(<span style="color: #859900;">int</span>(element))
        capacity.append(num_line.pop(0))
        priority.append(num_line)
    school_file.close()
    <span style="color: #268bd2;">stud_file</span> = <span style="color: #859900;">open</span>(student,<span style="color: #2aa198;">'r'</span>)
    <span style="color: #268bd2;">preference</span> = []
    <span style="color: #859900;">for</span> line <span style="color: #859900;">in</span> stud_file:
        line.strip()
        <span style="color: #268bd2;">line</span> = line.split(<span style="color: #2aa198;">','</span>)
        <span style="color: #268bd2;">num_line</span>=[]
        <span style="color: #859900;">for</span> element <span style="color: #859900;">in</span> line:
            num_line.append(<span style="color: #859900;">int</span>(element))
        preference.append(num_line)
    stud_file.close()
    <span style="color: #859900;">return</span> priority, capacity, preference


<span style="color: #859900;">def</span> <span style="color: #268bd2;">gen_sc</span>(nschool,nstud,overcap=<span style="color: #2aa198;">False</span>,maxovercap=<span style="color: #2aa198;">False</span>,savefile=<span style="color: #2aa198;">False</span>):
    <span style="color: #2aa198;">"""generates a (pseudo) random school choice problem with nstud students and nschool schools; if overcap ==True, the problem will have a higher number school places than students; maxovercap is a maximum overcapacity allowed; savefile=True will OVERWRITE/save the generated example in the files school.txt and student.txt in the current working directory"""</span>
    <span style="color: #268bd2;">capacity</span> = []
    <span style="color: #268bd2;">average</span> = <span style="color: #859900;">float</span>(nstud)/nschool
    <span style="color: #268bd2;">i</span> = 1
    <span style="color: #859900;">while</span> i&lt;= nschool:
        capacity.append(<span style="color: #859900;">int</span>(random.triangular(average/10.0,3*average,0.2*average)))<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">draws capacity from a triangular distribution between average/5 and 5*average with mode at 0.9*average</span>
        <span style="color: #268bd2;">i</span> = i + 1
        <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">print capacity, i, nschool, sum(capacity)</span>
        <span style="color: #859900;">if</span> i == nschool <span style="color: #859900;">and</span> overcap==<span style="color: #2aa198;">True</span> <span style="color: #859900;">and</span> <span style="color: #859900;">sum</span>(capacity)&lt;nstud:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">checks that enough places for all students are available</span>
            <span style="color: #268bd2;">capacity</span> = []
            <span style="color: #268bd2;">i</span> = 1
        <span style="color: #859900;">if</span> maxovercap!=<span style="color: #2aa198;">False</span> <span style="color: #859900;">and</span> <span style="color: #859900;">sum</span>(capacity)&gt;nstud + maxovercap:
            <span style="color: #268bd2;">capacity</span> = []
            <span style="color: #268bd2;">i</span> = 1
    <span style="color: #268bd2;">priority</span> = []
    <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nschool):
        <span style="color: #268bd2;">x</span> = <span style="color: #859900;">range</span>(nstud)
        random.shuffle(x)
        priority.append(x)
    <span style="color: #268bd2;">preference</span> = []
    <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nstud):
        <span style="color: #268bd2;">x</span> = <span style="color: #859900;">range</span>(nschool)
        random.shuffle(x)
        preference.append(x)
    <span style="color: #859900;">if</span> <span style="color: #859900;">sum</span>(capacity)&lt;nstud:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">creates a dummy school "nschool+1" to which every student not getting a place will be matched</span>
        <span style="color: #859900;">for</span> student <span style="color: #859900;">in</span> preference:
            student.append(nschool)
        priority.append(<span style="color: #859900;">range</span>(nstud))
        capacity.append(nstud)
    <span style="color: #859900;">if</span> savefile!=<span style="color: #2aa198;">False</span>:
        <span style="color: #268bd2;">school_file</span> = <span style="color: #859900;">open</span>(<span style="color: #2aa198;">'school.txt'</span>,<span style="color: #2aa198;">'w'</span>)
        <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nschool):
            <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(capacity[i]) + <span style="color: #2aa198;">','</span>
            <span style="color: #268bd2;">priority_str</span> = <span style="color: #859900;">str</span>(priority[i])
            <span style="color: #268bd2;">priority_str</span> = priority_str.strip(<span style="color: #2aa198;">'['</span>)
            <span style="color: #268bd2;">priority_str</span> = priority_str.strip(<span style="color: #2aa198;">']'</span>)
            <span style="color: #268bd2;">line</span> = line + priority_str 
            school_file.write(line)
            school_file.write(<span style="color: #2aa198;">"\n"</span>)
        school_file.close()
        <span style="color: #268bd2;">stud_file</span> = <span style="color: #859900;">open</span>(<span style="color: #2aa198;">'student.txt'</span>,<span style="color: #2aa198;">'w'</span>)
        <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(nstud):
            <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(preference[i])
            <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">'['</span>)
            <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">']'</span>)
            stud_file.write(line)
            stud_file.write(<span style="color: #2aa198;">"\n"</span>)
        stud_file.close()
    <span style="color: #859900;">return</span> priority, capacity, preference

<span style="color: #859900;">class</span> <span style="color: #b58900;">schoolchoice</span>:
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900;">self</span>,priority, capacity, preference):
        <span style="color: #2aa198;">"""read in data: priorities is a list of lists where the kth lower level list is the priority of school k, capacity is a list of school capacities (same order of schools as in priority), preferences is a list of lists where the ith sublist is the preference ranking of student i"""</span>
        <span style="color: #859900;">self</span>.priority = priority
        <span style="color: #859900;">self</span>.capacity = capacity
        <span style="color: #859900;">self</span>.preference = preference
        <span style="color: #859900;">self</span>.nschool = <span style="color: #859900;">len</span>(capacity)
        <span style="color: #859900;">if</span> <span style="color: #859900;">self</span>.nschool != <span style="color: #859900;">len</span>(priority):
            <span style="color: #859900;">print</span> <span style="color: #2aa198;">"input error: capacity and priority list must have same length"</span>
        <span style="color: #859900;">self</span>.nstud = <span style="color: #859900;">len</span>(preference)
        <span style="color: #859900;">self</span>.gs_match = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">will contain Gale Shapley match if this is calculated</span>
        <span style="color: #859900;">self</span>.boston_match = []
        <span style="color: #859900;">self</span>.ttc_match = []
    <span style="color: #586e75; font-style: italic;">#</span>
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">gs</span>(<span style="color: #859900;">self</span>):
        <span style="color: #2aa198;">"""uses the Gale Shapley student proposing algorithm to solve the matching problem"""</span>
        <span style="color: #268bd2;">flag</span> = 0 <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy used to indicate whether the algorithm has finished</span>
        <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
        <span style="color: #859900;">while</span> flag == 0:
            <span style="color: #268bd2;">flag</span> = 1
            <span style="color: #268bd2;">match</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">contains list of lists where the kth lower level list are the students matched with school k</span>
            <span style="color: #268bd2;">unmatched</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of unmatched students</span>
            <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):
                <span style="color: #268bd2;">proposers</span> = <span style="color: #859900;">filter</span>(<span style="color: #859900;">lambda</span> x: i==pref[x][0],<span style="color: #859900;">self</span>.priority[i])<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">list of students proposing to i in this round</span>
                <span style="color: #859900;">if</span> <span style="color: #859900;">len</span>(proposers)&lt;=<span style="color: #859900;">self</span>.capacity[i]:
                    match.append(proposers)
                <span style="color: #859900;">else</span>:
                    match.append(proposers[:<span style="color: #859900;">self</span>.capacity[i]])
                    <span style="color: #268bd2;">unmatched</span> = unmatched +proposers[<span style="color: #859900;">self</span>.capacity[i]:]
            <span style="color: #859900;">if</span> unmatched != []:
                <span style="color: #268bd2;">flag</span> = 0
                <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> unmatched:
                    <span style="color: #268bd2;">pref</span>[j]=pref[j][1:]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">pref[j].pop(0) #deletes the top preference for the unmatched</span>
        <span style="color: #859900;">self</span>.gs_match = <span style="color: #859900;">list</span>(match)
        <span style="color: #859900;">return</span> match
    <span style="color: #586e75; font-style: italic;">#</span>
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">ttc</span>(<span style="color: #859900;">self</span>):
        <span style="color: #2aa198;">"""Uses the top trading cycle algorithm on the matching problem"""</span>
        <span style="color: #268bd2;">unmatched</span> = <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">unmatched students</span>
        <span style="color: #268bd2;">match</span> = [[] <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool)]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">contains list of lists where the kth lower level list are the students matched with school k</span>
        <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference)
        <span style="color: #268bd2;">priori</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.priority)
        <span style="color: #268bd2;">counter</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.capacity)
        <span style="color: #859900;">while</span> unmatched != []:
            <span style="color: #268bd2;">cyc_stud</span> = [unmatched[0]]
            <span style="color: #268bd2;">cyc_school</span> = [pref[unmatched[0]][0]]
            <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">False</span><span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">indicates whether we have a cycle</span>
            <span style="color: #859900;">while</span> cyc_closed == <span style="color: #2aa198;">False</span>:
                <span style="color: #268bd2;">top_stud</span> = priori[cyc_school[<span style="color: #859900;">len</span>(cyc_school)-1]][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student with highest priority in last school in cyc_school</span>
                <span style="color: #859900;">if</span> top_stud <span style="color: #859900;">in</span> cyc_stud:
                    <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">True</span>
                    <span style="color: #268bd2;">cyc_stud</span> = cyc_stud[cyc_stud.index(top_stud):] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes the students that are not par tof the cycle</span>
                    <span style="color: #859900;">for</span> stud <span style="color: #859900;">in</span> cyc_stud:
                        <span style="color: #268bd2;">school0</span> = pref[stud][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the school to which stud is matched</span>
                        unmatched.remove(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the student from unmatched</span>
                        match[school0].append(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">adds the student to match</span>
                        <span style="color: #268bd2;">counter</span>[school0] = counter[school0] - 1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">decreases capacity counter</span>
                        <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the matched student from all schools priorities</span>
                            <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">using "try" avoids error if stud is not elligible at a certain school, i.e. not in its priority ranking</span>
                                priori[k].remove(stud)
                            <span style="color: #859900;">except</span>:
                                <span style="color: #859900;">pass</span>
                        <span style="color: #859900;">if</span> counter[school0] == 0:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes schools that have no capacity left from remaining students preferences</span>
                            <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud):
                                <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">the remove command below returns an error if a student did not list school0 in his preferences</span>
                                    pref[j].remove(school0)
                                <span style="color: #859900;">except</span>:
                                    <span style="color: #859900;">pass</span>
                <span style="color: #859900;">else</span>:
                    cyc_stud.append(top_stud)
                <span style="color: #268bd2;">top_school</span> = pref[cyc_stud[<span style="color: #859900;">len</span>(cyc_stud)-1]][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">most preferred school of last student in cyc_stud</span>
                <span style="color: #859900;">if</span> top_school <span style="color: #859900;">in</span> cyc_school <span style="color: #859900;">and</span> cyc_closed == <span style="color: #2aa198;">False</span>:
                    <span style="color: #268bd2;">cyc_closed</span> = <span style="color: #2aa198;">True</span>
                    <span style="color: #268bd2;">cyc_school</span> = cyc_school[cyc_school.index(top_school):]
                    <span style="color: #859900;">for</span> school <span style="color: #859900;">in</span> cyc_school:
                        <span style="color: #268bd2;">stud</span> = priori[school][0]<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student to which school points</span>
                        unmatched.remove(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">student is removed from unmatched</span>
                        match[school].append(stud)<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">adds the student to match</span>
                        <span style="color: #268bd2;">counter</span>[school] = counter[school] - 1<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">reduce counter by 1</span>
                        <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes the matched student from all schools priorities</span>
                            <span style="color: #859900;">try</span>:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">using "try" avoids error if stud is not elligible at a certain school, i.e. not in its priority ranking</span>
                                priori[k].remove(stud)
                            <span style="color: #859900;">except</span>:
                                <span style="color: #859900;">pass</span>
                        <span style="color: #859900;">if</span> counter[school] == 0:<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">removes schools that have no capacity left from remaining students preferences</span>
                            <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nstud):
                                <span style="color: #859900;">try</span>:
                                    pref[j].remove(school)
                                <span style="color: #859900;">except</span>:
                                    <span style="color: #859900;">pass</span>
                <span style="color: #859900;">elif</span> cyc_closed == <span style="color: #2aa198;">False</span>:
                    cyc_school.append(top_school)
        <span style="color: #859900;">self</span>.ttc_match = <span style="color: #859900;">list</span>(match)
        <span style="color: #859900;">return</span> match
    <span style="color: #586e75; font-style: italic;">#</span>
    <span style="color: #859900;">def</span> <span style="color: #268bd2;">boston</span>(<span style="color: #859900;">self</span>):
        <span style="color: #2aa198;">"""uses the Boston school matching algorithm to solve the matching problem"""</span>
        <span style="color: #268bd2;">flag</span> = 0 <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">dummy used to indicate whether the algorithm has finished</span>
        <span style="color: #268bd2;">pref</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.preference) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
        <span style="color: #268bd2;">capa</span> = <span style="color: #859900;">list</span>(<span style="color: #859900;">self</span>.capacity) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">useful as the algorithm manipulates this list</span>
        <span style="color: #268bd2;">match</span> = [[] <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool)] <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of nschool empty lists, kth list is list of students at school k</span>
        <span style="color: #859900;">while</span> flag == 0:
            <span style="color: #268bd2;">flag</span> = 1
            <span style="color: #268bd2;">unmatched</span> = []<span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">list of unmatched students</span>
            <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">self</span>.nschool):
                <span style="color: #268bd2;">proposers</span> = <span style="color: #859900;">filter</span>(<span style="color: #859900;">lambda</span> x: i==pref[x][0] <span style="color: #859900;">and</span> x <span style="color: #859900;">not</span> <span style="color: #859900;">in</span> match[i],<span style="color: #859900;">self</span>.priority[i])<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">list of students proposing to i in this round</span>
                <span style="color: #859900;">if</span> <span style="color: #859900;">len</span>(proposers)&lt;=capa[i]:
                    <span style="color: #268bd2;">match</span>[i] = match[i] + proposers
                    <span style="color: #268bd2;">capa</span>[i] = capa[i] - <span style="color: #859900;">len</span>(proposers)
                <span style="color: #859900;">else</span>:
                    <span style="color: #268bd2;">match</span>[i] = match[i] + proposers[:capa[i]]
                    <span style="color: #268bd2;">unmatched</span> = unmatched + proposers[capa[i]:]
                    <span style="color: #268bd2;">capa</span>[i] = 0
            <span style="color: #859900;">if</span> unmatched != []:
                <span style="color: #268bd2;">flag</span> = 0
                <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> unmatched:
                    pref[j].pop(0) <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">deletes the top preference for the unmatched</span>
        <span style="color: #859900;">self</span>.boston_match = <span style="color: #859900;">list</span>(match)
        <span style="color: #859900;">return</span> match

<span style="color: #859900;">def</span> <span style="color: #268bd2;">save_scp</span>(scp,filename):
    <span style="color: #2aa198;">"""saves an existing school choice problem with name scp as filename; advantage: will also save previously calculated matches and not only preferences etc."""</span>
    <span style="color: #859900;">with</span> <span style="color: #859900;">open</span>(filename,<span style="color: #2aa198;">'wb'</span>) <span style="color: #859900;">as</span> output:
        pickle.dump(scp,output,pickle.HIGHEST_PROTOCOL)

<span style="color: #859900;">def</span> <span style="color: #268bd2;">open_scp</span>(filename):
    <span style="color: #2aa198;">"""returns a previously as 'filename' saved school choice problem"""</span>
    <span style="color: #859900;">with</span> <span style="color: #859900;">open</span>(filename,<span style="color: #2aa198;">'rb'</span>) <span style="color: #859900;">as</span> <span style="color: #859900;">input</span>:
        <span style="color: #859900;">return</span> pickle.load(<span style="color: #859900;">input</span>)

<span style="color: #859900;">def</span> <span style="color: #268bd2;">save_match</span>(match,filename_school=<span style="color: #2aa198;">'match_school.txt'</span>,filename_student=<span style="color: #2aa198;">'match_student.txt'</span>):
    <span style="color: #2aa198;">"""saves a given match in 2 files: 'match_school' contains in line k the student numbers matched to school k; 'match_student' contains in line k the school matched to student k"""</span>
    <span style="color: #268bd2;">student_lst1</span> = []
    <span style="color: #268bd2;">school_lst</span> = <span style="color: #859900;">open</span>(filename_school,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> school <span style="color: #859900;">in</span> <span style="color: #859900;">range</span>(<span style="color: #859900;">len</span>(match)):
        <span style="color: #859900;">for</span> student <span style="color: #859900;">in</span> match[school]:
            student_lst1.append((student,school))
        <span style="color: #268bd2;">line</span> = <span style="color: #859900;">str</span>(match[school])
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">'['</span>)
        <span style="color: #268bd2;">line</span> = line.strip(<span style="color: #2aa198;">']'</span>)
        school_lst.write(line)
        school_lst.write(<span style="color: #2aa198;">'\n'</span>)
    <span style="color: #268bd2;">student_lst1</span> = <span style="color: #859900;">sorted</span>(student_lst1)
    <span style="color: #268bd2;">student_lst</span> = <span style="color: #859900;">open</span>(filename_student,<span style="color: #2aa198;">'w'</span>)
    <span style="color: #859900;">for</span> item <span style="color: #859900;">in</span> student_lst1:
        student_lst.write(<span style="color: #859900;">str</span>(item[1]))
        student_lst.write(<span style="color: #2aa198;">'\n'</span>)
    student_lst.close()
    school_lst.close()
</pre>
</div>

<p>
The following example generates a random problem with 15 students and 3 schools in which the total capacity is (i) at least 15 and (ii) no higher than 15+5=20. The data is not saved in files. This data is used to initialize a school choice problem called 'ex'. The Gale-Shapley matching is printed and then saved. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #268bd2;">priority</span>,<span style="color: #268bd2;">capacity</span>,<span style="color: #268bd2;">preference</span> = gen_sc(3,15,<span style="color: #2aa198;">True</span>,5,<span style="color: #2aa198;">False</span>)
<span style="color: #268bd2;">ex</span> = schoolchoice(priority,capacity,preference)
<span style="color: #859900;">print</span> ex.gs()
save_match(ex.gs_match)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; [[10, 13, 0, 4, 14, 6, 9], [11, 12, 7, 2, 1], [5, 3, 8]]
</pre>

<p>
The following example generates a similar example as above but this time the example is saved in the files 'school.txt' and 'student.txt'. These are then read and a school choice problem 'ex' is generated. The Gale-Shapley algorithm is run and the matching is saved using the default file names. Then the school choice problem itself is saved to a file called 'example1'. 'ex' is then deleted. Then the saved school choice problem (formerly called 'ex') is opened and saved as 'ex2'. This contains the result from the Gale Shapley algorithm we ran earlier and to illustrate this we print this result.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">print</span> gen_sc(3,15,<span style="color: #2aa198;">True</span>,5,<span style="color: #2aa198;">True</span>)
<span style="color: #268bd2;">priority</span>,<span style="color: #268bd2;">capacity</span>,<span style="color: #268bd2;">preference</span> = read_sc(<span style="color: #2aa198;">'school.txt'</span>,<span style="color: #2aa198;">'student.txt'</span>)
<span style="color: #268bd2;">ex</span> = schoolchoice(priority,capacity,preference)
save_match(ex.gs())
save_scp(ex,<span style="color: #2aa198;">'example1'</span>)
<span style="color: #859900;">del</span> ex
<span style="color: #268bd2;">ex2</span> = open_scp(<span style="color: #2aa198;">'example1'</span>)
<span style="color: #859900;">print</span> ex2.gs_match
</pre>
</div>

<pre class="example">
([[3, 2, 4, 6, 7, 12, 1, 10, 5, 13, 11, 9, 14, 0, 8], [12, 6, 9, 5, 14, 10, 8, 11, 2, 13, 4, 7, 0, 3, 1], [3, 13, 9, 6, 7, 11, 2, 5, 12, 14, 0, 8, 1, 10, 4]], [8, 8, 3], [[0, 1, 2], [1, 2, 0], [2, 0, 1], [2, 0, 1], [2, 0, 1], [1, 2, 0], [1, 0, 2], [1, 2, 0], [0, 2, 1], [2, 0, 1], [2, 1, 0], [2, 0, 1], [0, 1, 2], [2, 0, 1], [2, 1, 0]])
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; [[2, 4, 12, 11, 0, 8], [6, 5, 14, 10, 7, 1], [3, 13, 9]]
</pre>

<p>
The final example shows that the algorithm works quite fast even for big examples. We create an example with 20.000 students and 150 schools (this is approximately the number of new students in a city of the size of Stockholm) and see how long it takes the PC to solve the Gale Shapley algorithm.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">import</span> time
<span style="color: #268bd2;">start</span> = time.clock()
<span style="color: #268bd2;">priority</span>, <span style="color: #268bd2;">capacity</span>, <span style="color: #268bd2;">preference</span> = gen_sc(150,20000,<span style="color: #2aa198;">True</span>,1000,<span style="color: #2aa198;">True</span>)
<span style="color: #268bd2;">ex</span> = schoolchoice(priority, capacity, preference)

<span style="color: #268bd2;">mid</span> = time.clock()
<span style="color: #268bd2;">gsmatch</span> = ex.gs()
<span style="color: #268bd2;">end_gs</span> = time.clock()
<span style="color: #268bd2;">ttcmatch</span> = ex.ttc()
<span style="color: #268bd2;">end_ttc</span> = time.clock()
save_match(gsmatch)
save_match(ttcmatch)
<span style="color: #268bd2;">last</span> = time.clock()

<span style="color: #859900;">print</span> mid-start,<span style="color: #2aa198;">'seconds to generate example; '</span>, end_gs-mid,<span style="color: #2aa198;">'seconds to solve Gale-Shapley algorithm; '</span>, end_ttc-end_gs,<span style="color: #2aa198;">'seconds for TTC algorithm'</span>,last-end_ttc, <span style="color: #2aa198;">'seconds to save matching'</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 3.349452 seconds to generate example;  55.713012 seconds to solve Gale-Shapley algorithm;  920.508362 seconds for TTC algorithm 0.093598 seconds to save matching
</pre>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Gale, David, and Lloyd S. Shapley. "College admissions and the stability of marriage." American Mathematical Monthly (1962): 9-15.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
 <p>author: Christoph Schottmueller <br> license: Creative Commons Attribution ShareAlike 4.0</p>
</div>
</body>
</html>
